import 'package:get/get_navigation/src/root/internacionalization.dart';

class TextConst extends Translations {
  @override
  Map<String, Map<String, String>> get keys => {
        'en_US': {
          'mainTitle': 'সচরাচর জিজ্ঞাসা',
          'subTitle': 'ট্রেডিং কর্পোরেশন অব বাংলাদেশ (টিসিবি) এর কার্ড সম্পর্কিত বিভিন্ন প্রশ্ন এর উত্তর দেখুনঃ-',

          'collapseQ1': 'টিসিবি স্মার্ট ফ্যামিলি কার্ড এর জন্য কিভাবে নিবন্ধিত হওয়া যায়?',
          'collapseQ1Ans': 'ট- টিসিবির স্মার্ট ফ্যামিলি কার্ড এর জন্য আপনার এলাকার স্থানীয় প্রতিনিধি অর্থাৎ মেয়র/কাউন্সিলর/চেয়ারম্যান এর কার্যালয়ের আবেদন করা যায়। এটি নিম্ন আয়ের পরিবারের জন্য প্রযোজ্য।',

          'collapseQ2': 'টিসিবি স্মার্ট ফ্যামিলি কার্ডের জন্য নিবন্ধিত হতে কি কোনো ফি / টাকা দিতে হয়?',
          'collapseQ2Ans': '- না; কোন প্রকার ফি বা টাকা দিতে হয় না। সম্পূর্ণ বিনা মূল্যে এ সেবা প্রদান করা হয়।',

          'collapseQ3': 'টিসিবি স্মার্ট ফ্যামিলি কার্ডের জন্য নিবন্ধিত হতে সবচেয়ে গুরুত্বপূর্ণ তথ্য দু’টি কি কি?',
          'collapseQ3Ans': '- টিসিবি স্মার্ট ফ্যামিলি কার্ডের জন্য নিবন্ধিত হতে সবচেয়ে গুরুত্বপূর্ণ তথ্য হলো-\n১) উপকারভোগীর জাতীয় পরিচয়পত্র নম্বর ও জন্ম তারিখ\n২) উপকারভোগীর নিজের নামে নিবন্ধিত মোবাইল নম্বর',

          'collapseQ4': 'এক পরিবারে কতজন টিসিবি স্মার্ট ফ্যামিলি কার্ডের জন্য নিবন্ধিত হতে পারবে?',
          'collapseQ4Ans': '- এক পরিবারের জন্য একজন টিসিবি স্মার্ট ফ্যামিলি কার্ডের জন্য নিবন্ধিত হওয়া যাবে।',

          'collapseQ5': 'টটিসিবি স্মার্ট ফ্যামিলি কার্ড কখন এবং কোথা থেকে সংগ্রহ করা যাবে?',
          'collapseQ5Ans': '- টিসিবি স্মার্ট ফ্যামিলি কার্ড ডেলিভারীর জন্য প্রস্তুত হলে ফ্যামিলি কার্ডের জন্য নিবন্ধন করা্র সময় প্রদত্ত মোবাইল নম্বরের মাধ্যমে কার্ড বিতরণের স্থান, তারিখ ও কোড জানিয়ে দেয়া হবে।',


        }
      };
}
